/**
 *******************************Copyright (c)************************************
 *
 *                   (c) Copyright 2021, CY, China, QD.
 *                           All Rights Reserved
 *
 *                           By(南京万福祥电子科技有限公司)
 *                           http://www.njwfx.com
 *
 *----------------------------------文件信息------------------------------------
 * 文件名称: bsp__rs485.h
 * 创建人员: CY
 * 创建日期: 2021-09-18
 * 文档描述: 
 *
 *----------------------------------版本信息------------------------------------
 * 实验平台
 *          |--
 * 版本代号: V1.0
 * 版本说明: 
 *          |-1.0
 * 	         |-2021-09-18
 * 	          |-初始版本
 *------------------------------------------------------------------------------
 */

#ifndef __BSP__RS485_H_
#define __BSP__RS485_H_

#include "main.h"


void rs485_write(UART_HandleTypeDef* huart, GPIO_TypeDef* CS_PORT, uint16_t CS_PIN, uint8_t* pData, uint16_t Size);

#endif

/********************************End of Head************************************/

