/**
 *******************************Copyright (c)************************************
 *
 *                   (c) Copyright 2021, CY, China, QD.
 *                           All Rights Reserved
 *
 *                           By(南京万福祥电子科技有限公司)
 *                           http://www.njwfx.com
 *
 *----------------------------------文件信息------------------------------------
 * 文件名称: delay.c
 * 创建人员: CY
 * 创建日期: 2021-02-10
 * 文档描述:
 *
 *----------------------------------版本信息------------------------------------
 * 版本代号: V1.0
 * 版本说明:
 *          |-1.0
 * 	         |-2021-02-10
 * 	          |-初始版本
 *------------------------------------------------------------------------------
 */

#include "delay.h"

/**
  * 函数功能: 延时us
  * 输入参数: us 时间
  * 返 回 值: 无
  * 说    明: 无
  */
static void RA8889_Delaly_us(uint16_t us) {
    while(us--) {
        for(int i=0; i<6; i++); //简单延时 并不准确
    }
}

//延时N毫秒 ms
void delay_ms(unsigned short Nms) {
    delay_us((Nms * 1000));
}

//延时N微秒 us
void delay_us(unsigned long Nus) {
    RA8889_Delaly_us(Nus);
}

//延时N秒 ns
void delay_seconds(unsigned long Nns) {
    delay_ms((Nns * 1000));
}





/********************************End of File************************************/




